const Book = require("../book");

module.exports = {
	books: [
		new Book(
			"Выразительный JavaScript. Современное веб-программирование",
			"Книга дает читателю не только теоретические знания, но и предлагает большое количество упражнений и примеров для закрепления материала. Популярное издание глубоко погрузит обучающегося в тему JavaScript. Подойдет для желающих подтянуть свои знания по JS до базового и среднего уровня. Для практики предусмотрена песочница в интернете для выполнения заданий.",
			"Хавербеке Марейн",
			false,
			"/public/express.png",
			"file name 1",
			"/public/jsbook.pdf",
			"fileBook.png",
			"jsbook.pdf",
			"123456789",
		),
		new Book(
			"Вы не знаете JS",
			"В этой серии книг автор подробно и последовательно доносит до читателя особенности работы языка JavaScript. Все темы разбираются максимально детально и подкрепляются примерами. Первые книги серии вышли в 2014 году, последние были написаны в 2021. Руководства подойдут новичкам и тем, кто хочет освежить или закрепить знания. Если вы только начинаете знакомиться с языком программирования, читайте книги в представленной последовательности. Книги можно купить в бумажном виде, также материалы бесплатно доступны на github на английском языке в репозитории автора и на русском.",
			"Кайл Симпсон",
			true,
			"/public/fileBook.png",
			"file name 2",
			"/public/jsbook.pdf",
			"fileBook.png",
			"jsbook.pdf",
			"313sdse122121"
		),
		new Book(
			"JavaScript в примерах и задачах",
			"Подробное руководство по изучению JavaScript с большим количеством примеров и подробным разбором написанного кода. Автор претендует на собственную методику обучения. Самоучитель легко читается и подойдет для начинающих разработчиков.",
			"Алексей Васильев",
			false,
			"/public/fileBook.png",
			"file name 3",
			"/public/jsbook.pdf",
			"fileBook.png",
			"jsbook.pdf",
			"313sdse1dsdsds22121"
		),
		new Book(
			"Современный JavaScript для нетерпеливых",
			"Свежее и подробное руководство для изучения JavaScript E6 и выше. Книга легко читается, содержит в себе теорию и практику с примерами кода. Материал сопровождают забавные иллюстрации из «Алисы в стране чудес», а главы разбиты на уровни сложности: Нетерпеливый кролик, Алиса, Чеширский кот, Безумный шляпник.",
			"Кэй Хорстман",
			false,
			"/public/fileBook.png",
			"file name 3",
			"/public/jsbook.pdf",
			"fileBook.png",
			"jsbook.pdf",
			"313sdse1dsqqwdsds22121"
		),
	],
};
